jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/r_wifi_sx_ulpgn_if.h
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : r_wifi_sx_ulpgn_if.h
 * Version      : 1.0
 * Description  : API functions definition for SX ULPGN of RL78.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.01.2021 1.00     First Release
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/

#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"

#include "platform.h"
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
#include "r_sci_rx_if.h"
#endif
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#include "r_sci_rl_if.h"
#endif

#include "r_byteq_if.h"
#include "r_wifi_sx_ulpgn_config.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
#ifndef R_WIFI_SX_ULPGN_CFG_IF_H
#define R_WIFI_SX_ULPGN_CFG_IF_H

/* Driver Version Number. */
#define WIFI_SX_ULPGN_CFG_VERSION_MAJOR              (1)
#define WIFI_SX_ULPGN_CFG_VERSION_MINOR              (1)

/* Configuration */
#define ULPGN_CFG_SOCKET_STATUS_CHECK_FREQUENCY      (10)
#define ULPGN_CFG_SOCKET_CHANGE_BEFORE_WAIT          (800)
#define ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE        (2000LU)
#define ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD       (BSP_DELAY_MILLISECS)

#define ULPGN_CFG_SOCKET_CHANGE_ATUSTAT_RETRY_TIME   (400)
#define ULPGN_CFG_SOCKET_CHANGE_ATUSTAT_RETRY_COUNT  (2)
#define ULPGN_CFG_SOCKET_CHANGE_BUFFER_SIZE          ((WIFI_SOCKET_SENDABLE_DATASIZE + 20) * 3)

#define ULPGN_CFG_SEMAPHORE_BLOCK_TIME               (20000UL)

/**********************************************************************************************************************
 Global Typedef definitions
 *********************************************************************************************************************/
typedef enum
{
#if (1 == WIFI_SX_ULPGN_CFG_VERSION_MAJOR && 0 == WIFI_SX_ULPGN_CFG_VERSION_MINOR)
    WIFI_SECURITY_OPEN = 0,
    WIFI_SECURITY_WEP,
    WIFI_SECURITY_WPA,
    WIFI_SECURITY_WPA2,
    WIFI_SECURITY_UNDEFINED,
#else
    WIFI_SECURITY_OPEN = 0,
    WIFI_SECURITY_WEP,
    WIFI_SECURITY_WPA,
    WIFI_SECURITY_WPA2,
    WIFI_SECURITY_WPA2_ent,
    WIFI_SECURITY_WPA3,
    WIFI_SECURITY_UNDEFINED,
#endif
} wifi_security_t;

/*  WiFi API error code */
typedef enum
{
    WIFI_SUCCESS            = 0,    // success
    WIFI_ERR_PARAMETER      = -1,   // invalid parameter
    WIFI_ERR_ALREADY_OPEN   = -2,   // already opened
    WIFI_ERR_NOT_OPEN       = -3,   // not open
    WIFI_ERR_SERIAL_OPEN    = -4,   // serial open failed
    WIFI_ERR_MODULE_COM     = -5,   // cannot communicate WiFi module
    WIFI_ERR_NOT_CONNECT    = -6,   // not connect to access point
    WIFI_ERR_SOCKET_NUM     = -7,   // no available sockets
    WIFI_ERR_SOCKET_CREATE  = -8,   // create socket failed
    WIFI_ERR_CHANGE_SOCKET  = -9,   // cannot change socket
    WIFI_ERR_SOCKET_CONNECT = -10,  // cannot connect to socket
    WIFI_ERR_BYTEQ_OPEN     = -11,  // cannot assigned byteq
    WIFI_ERR_SOCKET_TIMEOUT = -12,  // socket timeout
    WIFI_ERR_TAKE_MUTEX     = -13,  // cannot take mutex
    WIRI_ERR_FLASH_WRITE    = -14,  // write failed : WiFi flash
    WIRI_ERR_FLASH_ERASE    = -15,  // erase failed : WiFi flash
    WIRI_ERR_FLASH_READ     = -16,  // read failed  : WiFi flash
} wifi_err_t;

typedef enum
{
    WIFI_EVENT_WIFI_REBOOT = 0,
    WIFI_EVENT_WIFI_DISCONNECT,
    WIFI_EVENT_SERIAL_OVF_ERR,
    WIFI_EVENT_SERIAL_FLM_ERR,
    WIFI_EVENT_SERIAL_RXQ_OVF_ERR,
    WIFI_EVENT_RCV_TASK_RXB_OVF_ERR,
    WIFI_EVENT_SOCKET_CLOSED,
    WIFI_EVENT_SOCKET_RXQ_OVF_ERR,
} wifi_err_event_enum_t;

typedef struct
{
#if (1 == WIFI_SX_ULPGN_CFG_VERSION_MAJOR && 0 == WIFI_SX_ULPGN_CFG_VERSION_MINOR)
    uint8_t ssid[33];           // SSID
    uint8_t bssid[6];           // BSSID
    wifi_security_t security;   // kinds of security
    int8_t rssi;                // RSSI
    int8_t channel;             // Channel
    uint8_t hidden;             // Hidden
#else
    uint8_t ssid[32];           // SSID
    uint8_t ssid_length;
    uint8_t bssid[6];           // BSSID
    wifi_security_t security;   // kinds of security
    int8_t rssi;                // RSSI
    uint8_t channel;             // Channel
#endif
} wifi_scan_result_t;

typedef struct
{
    uint32_t ipaddress;         // IP address
    uint32_t subnetmask;        // subnet mask
    uint32_t gateway;           // gateway
} wifi_ip_configuration_t;

typedef struct
{
    wifi_err_event_enum_t event;
    uint32_t socket_number;
}wifi_err_event_t;


